Autodesk.Revit.DB.Events.DocumentSaveToCentralProgressChangedEventArgs.FailureDueToConflicts
Indicates the 'save to central' failure is caused by submission conflicts, that is because another one finished saving to central first.
Since:
2017 Subscription Update

Autodesk.Revit.DB.Events.DocumentSaveToCentralProgressChangedEventArgs.SaveToCentralFinished
Indicates if current 'save to central' is finished.
Since:
2017 Subscription Update

Autodesk.Revit.DB.Events.DocumentSaveToCentralProgressChangedEventArgs.RetryTimes
The number of times Revit has tried to Save to Central." Its value is '0' at the first time.
Since:
2017 Subscription Update

Autodesk.Revit.DB.Events.DocumentSaveToCentralProgressChangedEventArgs.#ctor(Autodesk.Revit.DB.Events.DocumentSaveToCentralProgressChangedEventArgs)
Creates a copy of the DocumentSaveToCentralProgressChangedEventArgs.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017 Subscription Update

Autodesk.Revit.DB.Events.DocumentSaveToCentralProgressChangedEventArgs
The event arguments used during the save to central phase of Autodesk::Revit::ApplicationServices::Application::WorksharedOperationProgressChanged.
Remarks:
It is NOT recommended to do any time-consuming work when handling WorksharedOperationProgressChanged event. This can increase workshared operation time.
Name correction - it is renamed from 'DocumentSaveToCentralProgessChangedEventArgs' released since 2017 Subscription Update.
Since:
2017 Subscription Update